{"peft_config": {"task_type": null, "peft_type": "LORA", "auto_mapping": null, "peft_version": "0.19.1", "base_model_name_or_path": null, "revision": null, "inference_mode": false, "r": 4, "target_modules": ["to_q", "value", "to_v", "query"], "exclude_modules": null, "lora_alpha": 4, "lora_dropout": 0.0, "fan_in_fan_out": false, "bias": "none", "use_rslora": false, "modules_to_save": null, "init_lora_weights": true, "layers_to_transform": null, "layers_pattern": null, "rank_pattern": {}, "alpha_pattern": {}, "megatron_config": null, "megatron_core": "megatron.core", "trainable_token_indices": null, "loftq_config": {}, "eva_config": null, "corda_config": null, "lora_ga_config": null, "use_dora": false, "alora_invocation_tokens": null, "use_qalora": false, "qalora_group_size": 16, "layer_replication": null, "lora_bias": false, "target_parameters": null, "use_bdlora": null, "arrow_config": null, "ensure_weight_tying": false}}